{"review_id": "v_CgGiMv4U4i4CZ1-zYFdQ", "user_id": "ReDypdRmVA3wc-QG8HBKkQ", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 4.0, "useful": 5, "funny": 4, "cool": 3, "text": "I have a New Year's Day ritual of going to spas and doing the water circuit. I like being in hot thermal baths ideally in nature. It's just not the same experience dipping in and out of hot saunas, thermal baths and ice-cold baths inside a downtown spa, indoors. Doing it outside somehow makes the experience feel more authentic, like the way the Finns, Norwegians and Swedes do it where they actually roll around in snowbanks as well.  \n\nI came to Strøm today for the first time. It's located on Nun's Island right beside the pond in the back part of the island and indeed you feel like you're out of the city and not a mere 15 minute bus ride away from downtown Montreal. I came in using the Bus (#12 from Verdun) and was here in 30 minutes flat. Even in the middle of winter, it's a beautiful location so I can only imagine how lovely it must be in the summertime. It's too bad there isn't a pedestrianized bridge between Verdun's riverside and Nun's island because if that were the case, I could probably walk over in 5 minutes flat.\n\nI've been to other outdoor Nordic spas, like Le Spa des Chutes de Bolton, which has a real river and waterfall for dipping into and I have to echo other posters sentiments here. While the location is great, the facilities are clean, the design in somewhat off. Normally when you do the water circuit, you start off with getting your body very hot in the sauna or thermal bath pools then a 5 second dip in freezing water to get the heart pumping and then you chill in the relaxation area so it's ideal to have these 3 spots located VERY close to each other, especially when you walk out of freezing water. Not so here, there is a bit of walk between spots.\n\nAlso, I think practically all of Montreal had the same idea as I did and showed up today. There was a waiting list to get in if you hadn't made reservations. Thankfully the wait wasn't too long but this is something they should definitely mention on their website. It was crowded, not uncomfortably so because a crowded spa defeats its purpose, doesn't it? When I come again, I'm definitely coming at a less busy time. Bring your flip flops and your bathrobe to save some $$. \nThe lockers were somewhat small and the changing rooms can get crowded especially with everyone's winter boots taking up space. But the showers were clean and the relaxation rooms are definitely a great place to unwind with a glass of wine or rose-petal latte afterwards. \nFood here is pretty good. I had the French onion soup and it hit the spot.\nOverall, the place is absolutely worth a visit.", "date": "2017-01-02 04:40:29"}
{"review_id": "9yCuf-COFwkHL6l_LOmJ2g", "user_id": "qejIvhZGF0ssWRVDSvwMKA", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "This little oasis was just what I needed! It is truly special to be in a spa like this outside in nature, enjoying the beauty of a Canadian frozen waterway while basking in the warm glow of a fireplace in one of their relaxation rooms or in the Finnish dry sauna. The eucalyptus steam room helped clear my nasal passages and I enjoyed trying their multiple thermal baths. It seems to be a hidden gem amongst the locals, as some people from the city of Montreal had commented to me that they are reluctant to make the trek to Nun's Island and hadn't heard of it. It actually took about 15 min to get there from Montreal downtown, so I highly recommend doing it. The wine and food selection at their cafe was surprisingly good. Their assorted cheeses come with a lovely little smattering of nuts, dried fruit, sprouts, and carmelized onions paired with water crackers and baguette slices. I recommend you pay it a visit for a post-spa drink and snack for a little extra indulgence while you're at it! I happened to stay long enough that day to see Cozy Thursday happen which happens the first first of every month- after 6:30pm, the cafe has wine & food pairings for a special set price and a live dj. Definitely different atmosphere than during the day! Nice to know the spa can be lots of fun as well as relaxing.", "date": "2017-03-03 20:44:20"}
{"review_id": "hBrrYrdFVpzPqJEeK2454g", "user_id": "HAKgTj5ToDMCbLBkB6pELg", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 3.0, "useful": 2, "funny": 0, "cool": 0, "text": "Went for a Thursday night relaxation with a girlfriend. We had a massage each and access to the baths.\n\nWe both agreed that the massage was a fantastic experience and probably one of the best we ever had. therapists are respectful and very nice.\n\nHowever, the baths experience was not so great. First, it's very noisy. Everyone is talking pretty much in full voice. I don't mind a little conversation here and there, especially if whispered, but this make me feel like I was in the middle of a shopping mall, not a spa.\n\nSecond, the baths are somewhat limited, nothing extraordinary out of this world.\n\nThen it was time to leave as they were closing at 10 pm, which is disappointing, as they should be open later - there were lots of people who did not want to leave, so the demand is there! So considering we got there at 7pm right after work, the time to wait in line to be greeted and given the bathrobes and lockers, the time to take a quick shower and change, it was already 7.45. The massage was scheduled for 8.30, which left us about 25 min in the baths as they request that you be at the massage area 10 min before. one of massage therapists was late. so we were done by 9.45, at which point we were informed that the baths were closed and we should be heading to the lockers.\n\nThe locker space is very tiny! it gets crowded so quickly! people waiting in line to get to their locker, in line for the washroom, in line for the showers... Waaaaay not enough showers to accommodate a spa of their size. So we decided not to wait and left without a shower (which has NEVER happened to me in a spa before). Them, wait in line to pay and leave.\n\nFinally, I have an issue with the bath access fee. It should be free, or at least reduced for those having a massage. Not a good value for money. Walked out of there with $260 bill and really the only positive experience being the massage.\n\nNext time I would rather drive a little more and get to Polar Bear, which IMHO is waaaay better.\n\nif I would ever return there it would be for a massage.And even then, standing in an endless lineup after an awesome massage is not something I am looking for.", "date": "2014-01-17 14:01:04"}
{"review_id": "E7MDgwXpfPLqNNWXpJmMhA", "user_id": "cXH0QOJVRAw0GvIrZnWnaw", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "I have been hearing about Strom on Nun's Island for a very long time and couldn't wait to try it out on a cold winter weekend. The facilities are very nice although it is designed to host many people at once. The locker room is small, the amount of space in the hot pools and in the relaxation room is somewhat limited for a spa that welcomes dozens of people at once. It was thus very crowded on a Saturday afternoon. I do not recommend going to this spa on the weekends, it takes away all the relaxing part of going to a spa. The massage services are very nice. I was also surprised to see that there are no discounts given when you combine a massage with the water circuit, a policy that seems to be standard across most spas in the region.", "date": "2018-02-24 01:45:02"}
{"review_id": "k1tFOwGRwXN3UWPDlPUw_Q", "user_id": "6MM9Yqn7UBM8tmpSHQHAAg", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "Le Strom, c'est un oasis dans une grande ville qui fait du bien. J'aime y aller le soir après 18h quand c'est à rabais. En plein milieu de semaine (lundi au jeudi) c'est hyper tranquille et le moment idéal de relaxer et se ressourcer. Il y a un total de 3 saunas (un humide, un sec normal et un sec avec huiles essentielles) et plusieurs recoins pour relaxer entre vos séances de sueur! Mais n'oubliez pas la fameuse étape de l'eau froide dans les basins, sous la chute ou bien dans les douches nordiques. Bien qu'on prise le silence, pendant cette étape essentielle, vous risquez de criez vos sacres favoris, mais ne vous inquiétez pas, ça ne dure pas trop longtemps. Pour avoir une peau super, super douce, ça vaut la peine. Petits conseils pour sauver quelques sous tout en ayant une belle expérience: emmenez votre propre bouteille d'eau et votre robe de chambre pour un confort d'extra!", "date": "2012-11-06 17:33:26"}
{"review_id": "tVsnJxc4cAAYxxKi9o-n3Q", "user_id": "G422ejyfziG2xOtqgyKDWg", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "A great alternative if you want a Scandinavian Spa without having to drive too far out of Montreal (Literally 10 minutes from downtown Montreal). The architecture mixes modern (concrete square buildings) with traditional (wood accents). The spa is smaller than all the other Scandinavian spas, which makes it more intimate.\n\nMany different kinds of baths (hot and cold), saunas and steam rooms to alternate with. The massage therapist (forgot his name) was very professional and courteous. Above average massage.\n\nOverall a very enjoyable experience. My only disappointment is that I wanted to jump in the snow and roll around. However when we went, there was not much snow due to the pretty mild winter that we had. :P\n\nWill definitely be back!", "date": "2011-03-21 16:33:45"}
{"review_id": "crfgViQNXw2ecA3Boije1g", "user_id": "qKpkRCPk4ycbllTfFcRbNw", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "Spa nordique avec aires en exterieur joliment aménagé. Grandes piscines chaudes et le staff est courtois.\n\nTres beau pour les soirées plein lune.\n\nOn peut parler dans une de 2 piscines chaudes !! Et garder le silence dans les autres installations. \n\nFree tea , chaises confos et déco moderne.", "date": "2016-02-24 17:27:59"}
{"review_id": "n8e45WYV60v40gIkJLMVpg", "user_id": "3vGiPNH4yCAj88-kfdvbjw", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 3.0, "useful": 27, "funny": 4, "cool": 3, "text": "I'm sad to say that I had to log on to Yelp today to specifically take a star away from Strom Spa....\n\nI went back there today with some of my girlfriends and was really appalled by how I was treated with one of the girls at the front desk.\n\nI had chosen to get a massage/thermal bath today, and so after my massage, I headed over to the baths. Unluckily for me, my bathrobe happened to fall into a puddle of freezing water and so I made my way to the reception asking if it could be replaced. I was informed (verrrrrryy rudely) that \"we absolutely do not replace bathrobes here\".\n\nUmmm...okay? I guess the $200+ cost of coming to this spa entitles me to one robe, regardless of the situation. Wonderful.\n\nI went back downstairs and wrapped myself up in a towel instead, and sat down to enjoy lunch with my girls. We finished, and started heading out to the reception to pay.\n\nLucky for me, I had to settle my bill with the lady who wouldn't switch my bathrobe, but it didn't matter. Until she opened her mouth that is.\n\nThis was the exact conversation (no word of a lie):\n\nme: Hi, I'd like to pay please\nher: *something really fast in French that I didn't catch*\nme: Sorry?\nher: *repeating whatever she said*\nme: I'm sorry...my French isn't very good. I didn't get that..\nher: *saying it again in French, slower, with about 34 million tons of attitude*\nme: Can you please translate whatever you're saying into English?\nher: ARE YOU JUST PAYING FOR THE BATHS?!?\n\n....\nIt took me so much energy not to flip out on her then and there. Not only was she rude, but so unbelievably condescending then and throughout the rest of our interaction. I really loveD this spa, but really, if I'm going to shell out this kind of money, then the least I can expect is good service, no? Also, not impressed with the fact that I left really angry. What was the point of all that relaxation if I'm just going to be pissed off upon leaving?\n\nStrom, please give your employees training on how to deal with people. :/ So unimpressed.......", "date": "2013-12-08 05:36:54"}
{"review_id": "MBtAnRWiXDdPXK5WP7mqEg", "user_id": "BjeyTXxk61rAdWyHiLHg9w", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 2.0, "useful": 1, "funny": 2, "cool": 0, "text": "There are so many things that went wrong at this spa. I went with 4 of my coworkers during fall. We had called in earlier to book our massages. Unfortunately it was raining so we couldn't sit outside but we were able to enjoy the thermal baths. When we arrived at the spa, the receptionist gave us our robes but didn't provide us with much information about the spa. We had our massages booked early morning which we headed off first. I had a deep tissue massage which has been probably the best massage I've every had. I had booked it for 90 mins but it was much less than that, because you end up filling out a questionnaire, and answer the masseuse's questions which takes up a lot of the time. The bistro had good food but pricey and very very tight place indoors. It was so hard to walk because the tables were so close. They have flavoured water available through the spa. There wasn't much sauna/steam room options as compared to other spas. Two fairly large thermal baths. You can get other services outdoors where they have huts. When we went to pay at the end, things ended up in a fiasco. We probably spent 45 mins arguing with the receptionist and the assistant manager. Apparently the pricing changed for the spa the same week. When we called to make reservations, the person we all spoke to did not inform us. Their website was not updated either. One my coworkers initially butted heads with the assistant manager because she was overcharging her. When she explained herself the AM was very rude, showed attitude, and did not apologize for the confusion. She ended up paying the full amount which was $60 more than expected. When I arrived to pay, I was warned by my coworker of the situation. The receptionist ended up charging about an extra $120 than what I was supposed to pay. We argued back and forth. I was very clear of how bad they had managed the whole situation. That it was stroms staffs fault for not giving us the new prices when we made the reservations, not updating the website, nor explaining it to us on arrival. Both the receptionist and the AM were quite and had no argument other than these are the prices and you have to pay either a la carte or a package. However the package included services which I did not take advantage of. At the end they gave me a $20 discount which was due to a corporate discount my employer has with the spa. They asked if I was leaving satisfied and I said no, they wanted me to leave happy. I explained to them that this was the worst customer service I had ever dealt with where I came to relax and instead I'm leaving more frustrated and angry. I told them they have forced all of us to pay for something none of us wanted to. The staff showed so much immaturity in how to deal with such situations. Never have I been to a spa where they start a conversation with anger, attitude and roll eyes while trying to sort things out. It might have beautiful water view but not worth the headache. The two stars go for the massage itself and food and tea/water available through the spa.", "date": "2017-07-29 01:44:35"}
{"review_id": "jZUbfAFH_kcgiDEtrhxJWA", "user_id": "YZHTcdH3lKuJIDwqI5oDxQ", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Moi et des amies avons été là-bas, à l'occasion de la journée bachelorette, pour célébrer notre amie qui allait se marier. Dans l'ensemble, ce fut bien. Il faisait beau et chaud et c'était bien agréable.\n\nLe prix est de 49$ + taxes pour accéder aux bains la fin de semaine. 2 serviettes de bains et une clef pour un casier est inclus dans le prix. Le spa offre l'utilisation des séchoirs, coton-tiges, tampons de ouates, gel douche, shampoing et crème hydratante pour l'après-spa.\n\nLes seuls petits points négatifs: on ne peut pas consommer de l'alcool sans commander un repas. Ce n'est pas l'endroit idéal pour discuter (même à voix basse) dans les bains avec ses copines (nous étions 4 filles)...puisqu'il y a des massages dans des tentes à proximité des bains. Certains bains, c'est silence complet, sinon le staff vient rapidement t'avertir.\n\nEn fin de compte, c'est préférable d'y aller en couple ou en célibataire et de se payer un forfait massage/soins avec l'accès aux bains. Sinon, vous avez fait rapidement le tour.", "date": "2015-08-20 22:42:13"}
{"review_id": "tiDSqsF_ka5R6HWkAPNLhw", "user_id": "IeFZ42G8--O5MbYz4DRTDA", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 5.0, "useful": 0, "funny": 1, "cool": 0, "text": "This was my second visit to Strom.  My wife and I use it as an end of the year relaxation treat to melt away the pent up stress.  The cold weather make the outdoor thermal spas oh so luxurious: to see the snow falling as the steam rises is very relaxing.  This visit, I discovered the indoor relaxation room with a fireplace and a view to the frozen lake.  The room was silent except for the popping of the firewood and soothing music.  Very relaxing!\n\nOur first visit, employees were walking around shhhhh-ing rude people who were so self centered that they couldn't shut up for 10 minutes.  The signs everywhere say silence, not whisper or talk.  This visit, unfortunately, the abundant, rude talkers caused my wife and I to leave pools more than once.  Grow up, shut up and let others around you relax.\n\nPlease enforce the silence rule and I will not hesitate to come back here again and again.\n\nC'était ma deuxième visite à Strom. Ma femme et je l'utilise comme une fin de la détente traitement de l'année pour évacuer le stress refoulée. Le temps froid font les thermes en plein air ô combien luxueux: pour voir la neige tomber comme les hausses de vapeur est très relaxant. Cette visite, j'ai découvert la salle de relaxation intérieur avec une cheminée et une vue sur le lac gelé. La pièce était silencieuse, sauf pour l'éclatement de bois de chauffage et de la musique apaisante. Très relaxant!\n\nNotre première visite, les employés ont été promenait shhhhh-ment les gens grossiers qui étaient si égocentrique qu'ils ne pouvaient pas se taire pendant 10 minutes. Les signes partout disent silence, pas chuchoter ou parler. Cette visite, malheureusement, les causeurs, grossiers abondantes causé ma femme et moi de quitter piscines plus d'une fois. Grandir, enfermés et laisser les autres autour de vous détendre.\n\nS'il vous plaît respecter la règle de silence et je n'hésiterai pas à revenir ici encore et encore.", "date": "2014-01-02 16:43:13"}
{"review_id": "5wFdIYvqHs8-36hJ0JlAOQ", "user_id": "9P8-9EUP-aEnuisqUYt5jQ", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 5.0, "useful": 11, "funny": 4, "cool": 8, "text": "Gorgeous setting! The thermal jacuzzis are surrounded by stone and nature with a beautiful waterfall. I was mesmerized by the beauty here, it's all very well done.\n\nI don't really get why people go here to socialize  ie \"girls time\". To me, this is a place to go with a romantic partner or alone. It's not a club or bar environment where you can chat and \"catch up\". They play soothing music and the sound of the waterfall is really loud and thankfully masks the people chit-chatting.  On the other hand.. they have a group discount for 10 people or more so that kinda contradicts their \"be quiet\" mantra.\n\nI get that it's so close to downtown Montreal and people in Montreal LOVE to socialize but it's really a place for solitude and quietude. Thankfully, the staff is good at letting people know to quiet down. But really, the strong jet sounds and waterfall sounds do mask the talking to some extent but the sounds aren't overpowering or anything either.\n\nYou can request an indoor massage or an outdoor one in the tents. I opted for outdoor :) During my massage, I heard all kinds of birds from the marshland next to the water. One bird (or toad?) sounded like a rubber band, it was so cool. The tent blocked the wind but the sound of the tent swaying with the breeze along with the nature sounds was very memorable.\n\nYes, the showers are very basic but I think they want to discourage people from lounging around in the changing rooms. If you want to lounge, buy the \"thermal experience\" pass for $37-$49. The price varies based on the day and time of day. I've never seen a spa charge to use their jacuzzi if you're getting a service but I can see why they do this as they have invested a lot into their spa and it's outstanding. \n\nIf you just come here just for a massage or service: bring your own robe (call and ask sometimes they provide the robe, weird I know)  and be prepared for a basic shower. \n\nOf course bring your bathing suit if you're going for the thermal experience and flip flops. The products in the shower are good (from Dans un Jardin) but the lotion was a little strong scent-wise (smelled like cotton candy) so maybe bring your own lotion.\n\nThey provide you with a locker key that you keep on a rubber bracelet.\n\nFYI: Friday nights they have an \"under the stars\" event where it turns into a lounge with a DJ.", "date": "2017-06-19 02:49:26"}
{"review_id": "XXrdFCwXGMh8YK83wBSeKw", "user_id": "elEXpWfqI-nkVxZI7e_63Q", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 5.0, "useful": 0, "funny": 1, "cool": 1, "text": "I treated my boyfriend for a nice spa day for his birthday while we were vacationing in Montreal. The experience was unreal. It was slightly snowing out while we were in the hot baths overlooking a lake covered in snow. We also had an hour massage which was just okay. The relaxation rooms and the different saunas and spas made this place perfect. We jumped from room to room more relaxed than the next and without getting bored. We would have spent all day here if we didn't have some place to be. I would love to come back!", "date": "2016-05-10 04:28:32"}
{"review_id": "MBkzVbvCLGsu9qA25kgEdw", "user_id": "vo2i595_NE6-pr0nGcJVYg", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 5.0, "useful": 2, "funny": 0, "cool": 2, "text": "Petit havre de zénitude, de chaleur, simplement de aaaahhhh! Pour avoir essayé quelques spas, je trouve celui-ci  intéressant pour la propreté des lieux ainsi que la limite de gens qu'ils imposent. Cela favorise encore plus la détente. \n\nFormule classique, deux bains, un sauna à l'eucalyptus, un sauna aux huiles essentielles, un sauna simple, deux bains d'eau froide et des salles de repos. En parlant des salles de repos, il y en a avec grands lits et grosse couverte, excellent pour les couples. \n\nLe meilleur rapport qualité-prix est le prix après 18h, ou bien un forfait, ils incluent souvent les peignoirs et une gâterie pour quelques dollars de plus. Certains soirs sont thématiques, donc il est judicieux de vérifier avant. \n\nLe plus important est de prendre votre temps et suivre la recette suivante :\n\n10 minutes bain chaud,\n10 minutes Sauna,\n15 secondes dans l'eau froide,\nUn gros 30 minutes de repos ,\nRecommencer.\n\nDonnez-vous du temps à ne rien faire, simplement relaxez, votre expérience n'en sera que meilleure.\n\nJ'oubliais, l'idéal est entre -5C et -15C.", "date": "2014-02-10 22:14:08"}
{"review_id": "ZvOoNs_ONL30OPFQ-YUjoQ", "user_id": "WCHArapR0ZhduJElR9axjA", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 5.0, "useful": 8, "funny": 1, "cool": 5, "text": "Wow what a beautiful spa. Its tucked away at nuns island away from the citys hustle and bustles. The spa was very relaxing and spacey to cater to a lot of people without feeling crowded. The spa is big with 2 saunas, 2 hot and 2 cold baths, a steam room and has various relaxing rooms around. The best part is that this spa has a great lake view where you can sit by and listen to the birds chipping under the sky while enjoying the green scenery. Also their outside massage booths are located right on the lake edge. Its great in the summer where you can listen to nature look up the sky and just let all stress go. Also the relaxing blue swings was a good touch, in good places where you can really just swing off and chill. Plus its good enough for two people if you want to snuggle.\n\nThe bistro was fantastic. They do serve alcohol, but restricted to 2-3 glasses maximum. With some great bruchetta , cheese, and wine it finishes nicely for couples or even yummy wraps and smoothies for bigger groups. \n\nThey have a fireplace that looks great in the night and this spa also holds some great promotions throughout the year. Also the spa was clean, and the staff hospitality was good. However I wish they will add in some nice cozy bean bags here and there to make the place even more cozier. Until next visit.", "date": "2012-06-06 16:27:46"}
{"review_id": "cEOSK4HQc3TD1VTPSza37g", "user_id": "yR7c002FKAnehKj3rtexEw", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 2.0, "useful": 6, "funny": 0, "cool": 0, "text": "After 3 days of traipsing around Montreal, mostly on foot in 100F temperatures, I was dying for a pool, beach, or somewhere else that I could cool off. Being a fan of \"the thermal experience\" and not being a fan of spending a fortune or getting cruised by creepers, Strom seemed like the perfect solution. Tucked away on Nun's Island, it feels isolated from the hubbub of downtown Montreal without being too far away (it's a 15 minute bus ride from the Lasalle Metro + a 10 minute walk). \n\nI opted for the thermal experience by itself. $44 felt like too much, especially when a bathrobe is $10 extra (really who the hell lugs a bathrobe from home out to the spa?), but I was on vacation so I went for it anyway. Right away my relaxing experience was not that relaxing. As I entered I smiled at the front desk staff and said \"Hello, how are you?\" In return I received a quizzical look and a \"What?\" so I repeated myself. She did likewise. \"I said: Hello, how are you?\" finally got the point across but all I got was \"Oh, ok!\" in return. After visiting numerous shops, restaurants, and cafes over the previous 3 days, this was the first time I had any trouble communicating with a French Canadian. Is it a small detail? Yes. Are small details important, especially at a spa? YES. After that it was much more straightforward and I took my wristband/keyring down to the change room. \n\nAs change rooms go it was pretty small and sparsely furnished. No razors/cream available, no hair product, and no bathing suit spinner (serious oversight -_-). Still, it was clean with plenty of showers and secure lockers. The entire facility was sparkling clean and free of any funk or funny smells which is pretty important for somewhere you're hanging out in bare feet and a swimsuit.  \n\nTo my dismay, the thermal experience was seriously lacking. They boast 2 hot tubs - one is barely bathwater temperature and the other isn't much warmer. I honestly felt  like I could jump straight in with no discomfort. The jets in both were weak. Both saunas were ok - clean, smelled great (one was 'essential oils' the other 'finnish fir'), and working timers! However they were on the small side. When I was there it wasn't crowded, but any more people and it would have been uncomfortable. In a mixed gender sauna it's nice to have some room to spread out; there wasn't much room to do so.\n\nThe cold plunge pools were a welcome addition on a hot day, but I'm a bit dumbfounded as to why the have two. Both are very small (not that you would want to spend a ton of time in them). One is warmer than the other (still decently cold) while the colder one has a waterfall. \n\nAfter taking a few trips through the cycle, I wanted to check out the cafe/bistro. I walked inside and had a look about the menu. It may have been the fact that it was partly in French, but I found the menu scrawled all over the walls a bit hard to decipher. Nothing was truly appealing but after a few minutes standing at the counter watching employees walk around me, I decided to experiment. I stood there for a few more minutes looking over the menu thinking something might catch my eye. Ultimately I didn't want to spend $15 for a salad or sandwich and not a single employee greeted me or asked if they could help so I walked away. I guess because I don't look like a rich old guy my money is not important.\n\nOverall it's not terrible. Everything was clean and well maintained, but as a destination for the thermal experience only? Pass.", "date": "2012-07-23 19:59:45"}
{"review_id": "etPxXeTpX3ZowUBGNdVVpg", "user_id": "ZA2gQLfQm1Z8hvWzVpE-Kg", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "In my humble opinion, it's As good as a spa can get \"in the city\", even though it's technically off the island. Very relaxing, I actually appreciated the employees walking around and shushing people, because really, we're there to relax, blank out our minds and sort of push the restart button, not listen to other's loud stories and laughs. It's a good mix of modern with traditional, as far as the setting/atmosphere goes. Fair amount of baths and steam rooms to choose from. Obviously not as large as the ones further out of town, but if you're having a sudden hankering to relax and you don't feel like  driving for an hour, this place will definitely satisfy your needs.", "date": "2016-01-07 21:56:11"}
{"review_id": "OVfWBXwTTDAIpXEWKqxA-Q", "user_id": "1p9_GltqKn4_hChe_12n5g", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Everything I want in a spa. Perfection.\nClean. Tranquil. Sparse. Beautiful. Natural. Just superbly envisioned and executed. A delight at every turn.", "date": "2015-08-12 14:18:26"}
{"review_id": "kveQGq2xIi8h0cgFubar-Q", "user_id": "TGeIzTdHVvc8qH_KQt8y-Q", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 4.0, "useful": 5, "funny": 6, "cool": 3, "text": "If I could create a storyboard for one of the MasterCard Priceless commercials it would go something like this:\n\n   - Car service to STRØM Spa: $30\n   - Bathing suit since you forgot yours: $80\n   - Outdoor Thermal Experience in negative 12 degrees Celsius weather: $38 and very cold!\n   - 60-minute Signature STRØM Massage: $94\n   - Herbal Chai Tea to warm you up: $3\n   - Best almond cake which made the entire experience worth it: $5 (in our eyes $250)\n\nYou and one of your best friends having an unforgettable and well deserved time in Montreal: PRICELESS!", "date": "2013-03-01 04:11:17"}
{"review_id": "gDPuO4-vMCi9Dder5uC61w", "user_id": "gZKrQxAG2cpsXpwOMLvcow", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 4.0, "useful": 5, "funny": 2, "cool": 3, "text": "Rating 4 for my masseuse and the spa amenities, 2.5 for the front desk staff.\n\nHad literally found out the day before that I was expecting so called them right away and explained my situation and they happily changed my massage from a shiatsu to a prenatal massage with no penalty fees.  Thank you Strom!\n\nMy masseuse happened to also be a midwife for the past 20+ years as well so I felt like I  thoroughly received the royal treatment!  Spent the rest of the day in their hot and cold pools relaxing and unwinding and also loved the different heated and aroma  therapy relaxation rooms as well.  \n\nFront desk is a bit brusque both during checking in and checking out.  Not sure why that is.  Their spa cafe was both clean, inviting and food selections all delicious.  I liked that men and women were able to mill about the property together in the common spaces.  Will definitely visit here again!", "date": "2015-11-10 17:32:20"}
{"review_id": "34ED18ch4SJqQy8jDRN8SQ", "user_id": "vgMuhtfucl7Vtpy1WvaAbg", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Nice place.  Visiting from California.  My only complaint is that some of their guests tend to complain about English speakers.  So keep English to a minimum if you want to have a relaxing time.", "date": "2017-07-13 19:12:37"}
{"review_id": "uZkiRUi6E2-nGUebPcYWgA", "user_id": "1hJQYk3NiajdYK58TQi9EQ", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Went to Strøm spa for the first time the first week of Oct. I had a coupon that made it a very good price for two. It's a convenient location if you have a car and good directional sense as I nearly took the wrong turn a couple times. I seriously think Nun's island is the only place in Montreal and around that has roundabouts! On the outside it looks unassuming but their facilities are quite nice and clean.  I found it enjoyable at 15C but it could stand to be better if even warmer. The difference I noticed from other sites is they don't enforce many rules such as no loud taking, no cell phones, etc. If you prefer to have a quiet experience, take the morning or early afternoon off and go. It could be quite busy during peak hours and not as relaxing.", "date": "2016-10-30 01:15:46"}
{"review_id": "plGsPfKQfYWonHv19uGePA", "user_id": "980MSuSR9dcF-Lassdy5Ow", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Strømmmmmmmmm omg, le meilleur spa en ville (pour moi car abordable (étudiant)), super propre, super original, bien administré et surtout pas délabré (PolarBear).... Nous vous demandons si c'est la première fois que l'on vient? Non? Voilà c'est tout. Tellement de temps gagné! Les fin de soirée en basse saison sont tellllement abordable! 29$ pour être seul en plus. C'est génial. La nourriture est très dispendieuse malheureusement et au vu que c'est exigent pour l'appétit ça finit cher finalement. :( mais je prend un petit quelque chose et je m'en sors bien! :) dommage que les peignoirs ne sont pas inclus, mais on peut amener le nôtre sans soucis! Pour ce qui en est de la température de l'eau, j'ai vu plus chaud, mais à ces températures on peut rester plus longtemps! :) j'y retourne tout le temps! Ps : un nouveau Strøm a ouvert en région!!!", "date": "2014-11-21 16:48:31"}
{"review_id": "F86Qchlka-xjKP2yLClmMQ", "user_id": "Y9uJlgOPCCiGh-vmrctMjQ", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "The first time I came here, we really lucked out. It wasn't busy and everything went smoothly. This second time that I came here, it seemed like everyone in the Montreal area just discovered this spa.\n\nWe had to wait 1hr and 30mins in the waiting/reception area-bring your work, novel, memoirs with you to pass the time. There must've been at least 30-40 people waiting.\n\nWe finally got in, but of course the locker room was also packed. I needed to take a number 2 in the one bathroom stall, but there was no toilet paper and the toilet didn't flush! It was like being in Cuba, but within Canada! Needless to say, I held off on doing my business. \n\nThe thermal water treatments were good as usual, but it's annoying that there's only one jacuzzi where we're permitted to speak. We where shushed in the other facilities. Heck, I was even shushed in the talking jacuzzi- it's a spa, not a library, church, or Buddhist temple!\n\nThe jacuzzi needs floor lights, especially at night. The facility desperately needs to expand because they clearly cannot keep up with demand.\n\nThe restaurant needs to be seriously audited because the food is one star with a five star cost. Tim Hortons makes better coffee! \n\nWhen checking out, we encountered a mass of confusion. The lines for checking in and checking out had merged into some disgusting blob of humanity. This process needs to be more organized. It took me about 25 mins to check out (plenty of time to fill out their survey).  With 3 hrs until closing, there was 40 people waiting in the reception area.\n\nBefore coming here, have a good solid meal, take a satisfying dump and bring all the patience you can muster. And don't forget- shush!!!", "date": "2018-02-06 13:43:52"}
{"review_id": "QD38pTabHQGl5Ik_13Ka0g", "user_id": "9oqNFcP7r-BG3WZQDFtx1w", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "I would have given this place 4/5 stars based on my little spa visit experience. But unfortunately, I got a viral skin infection from their anti-ageing facial treatment that was about $200. Not sure if it was from the extraction or the creams. Had to go to a walk-in clinic three days later and they prescribed me a $90 cream to treat the nasty and ugly infection on my forehead. I had many facials in my life and never had a bad reaction. This was a shocking first. Emailed the spa to complain, but never received a reply.", "date": "2016-11-17 20:05:39"}
{"review_id": "cnnJeolULgMMXuEPMstUgQ", "user_id": "dgFwd3OckcA8x6RvD__8hA", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 1, "text": "I used to frequent this spa when I was living on Nun's island and missed it during my time in Toronto...Now that I've moved back to Montréal, I decided to go for a girls' time visit with a friend on a Saturday morning. The grounds and facilities are as lovely as I remembered! Very clean, relaxing and serene  \n\nThe food in their bistro is a tad overpriced but delicious and worth it in my opinion (tartare heaven!). \n\nThe only complaint I have is regarding the front desk staff. I had pre-purchased packages for my friend and I online on the Strom website and printed out the confirmations. When we were leaving, the girl at the front desk made us wait for over 30 minutes (?!?) while she \"verified\" the confirmations. I had to go up and ask her several times what was happening and even offered to leave my credit card number so we can just leave already. She was quite unhelpful...ontop of it, she didn't even have the courtesy to let us know when everything was \"confirmed\", I had to find out by going up to ask her yet again. A frustrating end to a very nice experience otherwise.", "date": "2017-02-26 08:10:34"}
{"review_id": "fhR2cXRL7mraxQxWe6yJAA", "user_id": "gS4QCL6j_umAyfJXBGAZJQ", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 5.0, "useful": 2, "funny": 1, "cool": 1, "text": "This spa is out of this world!  Located just 10 minutes drive from downtown Montreal, on Sister's island - Storm feels like you further away from the city than you really are.\n\nTheir facilities are cleaned and well-kept.  Steam room, sauna, hot & cold pools plus resting areas - everything you need to spend a relaxing day at the spa.  Also, they have an on-site bistro that makes yummy healthy eats for your spa time.\n\nI would highly recommend trying their services, the massage was one of the best I have received.  Check out their specials on their site.  My husband and I got a crazy deal on one of their specials.\n\nIf you are ever in the Montreal area, check out Strom for a lovely spa day.", "date": "2016-01-08 02:42:31"}
{"review_id": "yLzkk1CMryC_R9QaPfpk9A", "user_id": "dNIxs3_qcAuF8S9kS9iFCQ", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 2.0, "useful": 2, "funny": 0, "cool": 0, "text": "The location at Nun's Island and lake landscape is amazing. The space is kind of small though. Staff-wise, the receptionists are very friendly and accommodating; the masseuses know what they are doing, super professional and I don't have any complaints; the manager, cold and condescending, even though she wasn't even that much older than me, she was talking to me like I was a little kid. They gave me an XXXL robe by mistake, but I wasn't mad because it was really flowy and comfy, the downside was that I would drag the waistband.\n\nI got a romantic package for two, Lempia, as a birthday present to my girlfriend which included: 90min couple massage, thermal/water experience, two smoothies and two water bottles. First of all, the staff kept referring to my girlfriend as my \"friend\", which was super weird. Second of all, I've been to Bota-Bota and SkySpa (Dix-30) so I know there are rules in place, but in this place it feels like you are actually being surveilled. In SkySpa, for example, staff would approach you if you were being too loud, which is understandable. But Strom was actually next-level, it was literally all the staff circulating all over the place with an earpiece and talking/observing the whole time, it kind of looked like the president's security team and it was honestly too much. \n\nThe massage was great all-around and the hammocks are lovely and comfy. The water experience, they don't have as many pools as Bota-Bota does, I found myself in a Goldie Locks type of situation, where two pools were too cold and the other two were too hot! I was surprised that there were that few! The smoothies were decent, I didn't try the rest of their food, but it looked good. \n\nAlso, I was weirded out by the fact that they include the water bottles as part of the package, because I saw receptionists giving them to everyone going in. I don't know if they all had packages that included water or if they just put that in the offer to make it sound like they are offering you more stuff? I liked my Bota-Bota experience way way way more. My girlfriend enjoyed her birthday despite the issues, but not due thanks to the way they run things there.", "date": "2017-08-03 19:25:28"}
{"review_id": "fE2dqBQrGwQVpXN_pSciRA", "user_id": "9rEQtVw5En6jm8gN9vCWPQ", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 5.0, "useful": 3, "funny": 0, "cool": 1, "text": "Fan de spas depuis seulement 4 ans, je suis tombée sur le Strom par hasard en mai 2009 avant même son ouverture.  ET QUELLE DÉCOUVERTE !!!  Le Strom est un pur oasis de détente en pleine ville !\n\nJe m'y suis rendue en transport en commun un beau matin d'été alors que le pavé n'était pas encore terminé ; 15 minutes d'autobus à partir du centre-ville puis 5 minutes de marche et HOP on est rendu !\n\nUne fois là, les deux pieds dans la détente, je suis accueillie dans une atmosphère hyper détendue ;  sur des airs de musique cool, on me guide vers l'aire d'attente où je remplie ma fiche de client.  Quelques instants plus tard, mon thérapeute vient me cueillir et m'amène dans la salle.  Un des meilleurs soins reçus !  \n\nAprès, je me dirige à l'extérieur (à l'arrière) ; quel paysage !  On se croirait en \"région\".  La verdure de l'Île-des-Soeurs, l'aménagement paysager et les installations du spa (qui se mêlent très bien à la nature), la vue sur le lac des Battures, les canards et les oies qui se promènent sur le lac... si je n'étais pas du coin, jamais je n'aurais pu dire que j'étais tout près du centre-ville d'une grande métropole.\n\nCe qui est d'autant plus chouette, c'est qu'on peut aussi très bien y boire et manger.  Le bistro au rdc offre jus de fruits, smoothies, bières et cocktails ainsi que muffins et viennoiseries et un bon menu de soupes, sandwichs et salades.  Pour y avoir mangé à quelques reprises, je raffole de leurs paninis et de leurs smoothies sont délicieux... Mm mm mm ! \n\nD'ailleurs, je me dois d'essayer le Strom en PM, alors que le soleil se couche ; je suis certaine que l'option massage ou soin, suivie d'un cocktail et d'un petit mezze puis d'une baignade dans les bains chauds et froids sera une expérience tout aussi extraordinaire !\n\nEnfin, tout fan de spa vivant à Montréal (ou aux alentours) se doit d'essayer au moins une fois le Strom.  Perso, que de l'avoir essayé a été de l'adopter !", "date": "2011-06-21 04:33:46"}
{"review_id": "aErx1zP39NRwRGNZ5H8wOQ", "user_id": "3WLG-78j3j60hv-3umQ6Eg", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Nice place to relax, installations are rarely modern but are starting to show some wear (pool tiles and wood decking) nothing major. \n\nGrounds are rarely small and I can imagine this place gets crowded at times. \n\nI would still recommend a visit.", "date": "2016-05-17 15:15:10"}
{"review_id": "6oDCjF1R0hlJq30wlSUt3A", "user_id": "UhcZDIn_teMUbBjP653VIQ", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 5.0, "useful": 1, "funny": 0, "cool": 2, "text": "Place très agréable !\nTrès bon accueil, vous vous présentez à l'entrée, on vous remet 2 serviettes et un bracelet pour les vestiaires (et la facturation au bar).\nPour un peignoir, c'est 10 $ (ça évite de salir le votre, surtout à l'exterieur).\nPlusieurs bains, des chauds, des froids, un hammam à l'eucalyptus, un sauna et salles détentes.\nC'est sympa quand il fait très froid et d'y aller au modèlent du coucher du soleil !\nLe silence est de rigueur, le chuchotement est permis à certains endroits...\nDans les vestiaires, vous aurez le droit à des douches avec gel douche, shampoing, lotions pour le corps. Sèches cheveux et rince bouche disponible.\nJ'ai vraiment adoré !\nRegardez leur site, plusieurs forfaits, des rabais après 18h (29$).", "date": "2014-03-26 23:33:15"}
{"review_id": "49_QHd-vMG3XkgMBg5aFFQ", "user_id": "qKpkRCPk4ycbllTfFcRbNw", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 5.0, "useful": 3, "funny": 0, "cool": 0, "text": "Spa nordique en exterieur joliment aménagé. Grandes piscines chaudes et le staff est courtois.\n\nTres jolie les soirées plein lune.\n\nOn peut parler dans une de 2 piscines chaudes !! Et garder le silence dans les autres installations.\n\nFree tea et chaises confo et deco moderne :)", "date": "2016-04-06 20:31:14"}
{"review_id": "Y0-4ofZ7cWqHSzdQU__umg", "user_id": "pEzb9RfmnD2zn5wUPpdmzg", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 5.0, "useful": 4, "funny": 0, "cool": 1, "text": "L'ultime détente en plein air !\n\nSitué a 9 minutes a pied de chez moi, le STROM est parfait. Le service y est extrêmement courtois, l'endroit est propre, calme, discret. Pas comme d'autres spas que j'ai visité dans les dernières années ou les gens font fi des reglements sur le silence... \n\nLes installations sont modernes et variées : 2 saunas (un a l'huile essentielle et un traditionnel), une chambre vapeur a l'Eucalyptus, plusieurs salles de détente et des hamacs pour relaxer, une chute glacée et un bain froid, 2  bains chauds, un feu de bois en plein milieu. Magnifique endroit. \n\nPour les soins : les thérapeutes sont en or ! Nous avons fait un massage double (en couple) avec chacun un masso, mais dans la même pièce. Je vous recommande leur massage signature maison. (STROM signature) avec des coquillages chauds et différentes techniques en un seul traitement. Discrétion et professionalisme au rendez-vous. \n\nAutres points forts : \nbistro servant des mets légers au choix * un peu cher *\nmassages disponibles en plein-air durant les mois d'été (yourte)\ninclus avec une massothérapie : peignoir et rabais sur les bains.\nOuvert le soir !", "date": "2012-05-14 18:17:08"}
{"review_id": "-Ex_v5SKOkodJS_RZUquFA", "user_id": "wffnrXJoLppOlvNOZKU70A", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 3.0, "useful": 1, "funny": 3, "cool": 0, "text": "Here's the thing: this used to be my favourite spa in Montreal. But that was years ago. \n\nMy first massage was at Strom about 7 years ago and it was an amazing experience. I usually visit around twice per year with friends but on my last few visits, I've been very disappointed - especially during my last experience last week.\n\nFirstly, they keep putting up their prices. Not sure why because they haven't added anything new so already there, I'm not impressed. My last visit cost me over $200, which has never happened to me before and I have been to so many spas! There is no longer a discount if you combine a massage to your bath experience. I think it's obvious that it's a greedy attempt to make more money off of their customers.\n\nTheir robes feel worn and are not as soft probably because this spa has gotten so much more popular over the years that even going on a Friday morning/afternoon is now way too crowded. The amounts of couples that come here to... \"get in the mood\" for a lack of a better way to say it is surprising. Maybe they should build a hotel nearby! I understand shushing groups of people to be quiet but it borders on harassment at times. How come I have to put up with intensely loud make-out sessions from couples stuck to me but I have to be silent 24/7? This is definitely not the kind of spa where I would be comfortable going alone. \n\nTheir massotherapists are always professional and courteous - no complaints there. I especially love getting massages outside in the tents; the natural sounds of the waterfall or the birds chirping really add to the relaxing massage experience as a whole. At their bistro, I ordered the grilled halloumi cheese and fennel salad, as well as the tuna wrap. This healthy and filling lunch set me back around $30. \n\nAll in all, I don't think I'll be going back any time soon unless I have a gift card or a special reason to. It's such a shame because this is the most beautiful spa in Montréal.", "date": "2017-07-24 23:51:58"}
{"review_id": "MTrDbqvUcqJVQWnQQFItng", "user_id": "cirVwoeEPl0PyEXQhHz9iw", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great spa! Loved the thermal experience and our massages! Great for a girls day, but guys are welcome too!", "date": "2017-05-10 01:41:39"}
{"review_id": "PpBMedJVHjM_dwhmeey7NQ", "user_id": "IW7pp1kpfAnNEQGB6pqbug", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 2.0, "useful": 2, "funny": 0, "cool": 0, "text": "I was amazed at the amount of shushing for the quiet conversations we were having.  It was incredible!  I've never seen anything like it.  DO NOT GO IF YOU ARE GOING WITH FRIENDS TO CATCH UP.  also you have to pay $10 for a bathrobe?  go to http://www.botabota.ca/ it's money better spent.  they don't shush you and they give you bathrobes FOR FREE!!!\n\nif they let people have quiet conversations and gave the bath robes as part of the deal i would like this place a lot better.  it's decent with two nice hot pools one stonehenge-y bubbly pool and one with a hot waterfall!  and two saunas one with aromatherapy.  one one super hot intense steam room with a red light.\n\nit's also very couply in the evening almost like a swingers rave so be warned.\n\ni would go alone but not with a friend again as i go to the spa to relax and catch up with friends \n\nbota bota is much easier to get to too! and really something different after being to spas all over europe and asia.", "date": "2012-11-05 05:01:22"}
{"review_id": "IgkabSUkak-nxRSmYUd_Vg", "user_id": "fU9b0jHQFQms4aA5nnqRfw", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "Ugh. I would love to tell you all about how amazing this spa is but unfortunately we have never been able to actually get in. \nAs a subscriber to the newsletter, i see that frequently Strom offers great deal on the thermal experience. Myself and 5 friends all bought one of these deals to celebrate a birthday. However, when you get to the spa to redeem your package deal you are not allowed in. You are immediately wait-listed. The reason - they must reserve the space for people who have booked a service. I pointed out that not everyone who have booked a service are also going to opt for the thermal experience they told me that it doesn't matter. There are not enough lockers. They put you on a waiting list but cannot tell you how long the wait will be. (It ended up being 6 hours the last time we attempted to go). I asked for a refund on the deal we purchased explaining that I paid for a service that they clearly cannot provide me. They said that there are no refunds. What we learnt is that the only way to guarantee entry is to book a service. So you deal that cost $60 actually ends up costing at the very least $90 plus tip and could go up to double depending on the service you book. Additionally, the location is not that convenient and there is nothing around it so even if you get waitlisted there isn't anywhere close by that you can go to to kill time.\nIt really feels like the deals that they send out frequently are a scam. It is just a way to force you to buy a service because they do not have the capacity and do not reserve places for ppl who just want to experience the thermal option. I am very disappointed. Four other couples came in while we were there that had the same issue as myself and my friends and also mentioned that this was the 2nd or 3rd time that they tried to gain entry. Basically I have thrown away $60 or I have to spend an additional $30 to get an overpriced express mani. And honestly, I don't want to give these people anymore of my money.", "date": "2017-11-13 15:09:24"}
{"review_id": "Gl9WH79m1gSdcjVZtq3NHg", "user_id": "FRj2bwwFoXGodqKXS-PGMg", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "This was very relaxing, though I would have preferred to go while the sun was still out.  With all the steam rising, it was a little foggy to navigate at night.\n\nThe massage was pretty good, if you like gentle relaxing massages (not the kind that actually undo knots - which can be painful)\n\nThe light meal was pretty good...not gourmet, but pretty tasty.\n\nOverall the experience left me feeling very zen.  The only complaint I have is the state of the bathrooms.  There was a lot of hair, and the toilets could have used some cleaning.  Also, someone knocked my robe on the floor at some point, hence it got wet, and they wouldn't exchange it for me, hence I had to walk around in a very cold wet robe.", "date": "2011-12-21 05:23:23"}
{"review_id": "RpFefvCPXQ1l6SvGpD3Ifw", "user_id": "sAB5MmC1yTCfbn28EI_I3A", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "The Strom Spa is not the largest spa in the Montreal area, but I love the location, I really enjoy the various events they do on Thursday nights such as the Cozy Thursday, or the All night event where you are free to talk without any worries (especially good for my ladies friends who always like to bend the rule!! :-)\n\nThe bar and food are also very enjoyable!", "date": "2014-04-30 12:34:47"}
{"review_id": "1N26YQ7EaSN2B9e2zBF65g", "user_id": "2fnC7JqE_mRt0CYvAvPqJg", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "All I can say is wow!!  Never been to a spa like this. Loved where you are able to relax outside by the fire pit, in the hot tub etc.  Wish I scheduled my massage for outside in one of the tents instead of in the building. Just couldn't picture how it would be in a tent. \n\nWant to go back to Montreal from the US just to go here again.", "date": "2017-08-02 21:16:13"}
{"review_id": "TG_WEJsO64bj9n3YycY3pA", "user_id": "Y_THfSDiDU8gCKB8e1ByaQ", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 3.0, "useful": 0, "funny": 1, "cool": 0, "text": "I have been I several bath houses or saunas as they are called here in Canada. Strom is a bit different from what I am used to.  First off, there's no clothing-optional area- big disappointment. Nothing is more relaxing than taking a sauna or steam sans bathing suit. Secondly, they are VERY insistent that it is as quiet as possible in every area imaginable. \n\nOn the plus side, the facility is very nice and extremely clean. The husband and I sprung for a 60min massage, which was excellent. The natural setting is very enjoyable if it isn't too hot out.", "date": "2012-08-07 23:49:53"}
{"review_id": "y2Q1zM5N_cqxqK9C2AMNHA", "user_id": "MDXqulpNz_WcAJd-mclwoA", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is not a bad spa but not my favorite. My big issue is with the changing area and lockers. Not a lot of room in the locker rooms and the area is kind of outdated. The spa itself is fine. There is a good number of baths and relaxation areas. In the winter however, when there is a lot of ice, it can get a little slippery.", "date": "2018-11-03 21:37:14"}
{"review_id": "NnWpcslShMXz0-S64WTG_g", "user_id": "LlMfTEapbG0ikzdoqA8oGQ", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "A nice day getaway. In my case, a good post car accident retreat! There was no time limit to use the baths with my \"Alizé\" package so I felt the price was worth it (I stayed from 10h00-17h30).\n\nA negative point:\n\nI arrived on site at 9h50 knowing the baths opened at 10h00 so that I could slowly get ready and try to spend the most time possible at the spa. I tried to open the front door multiple times but after trying so hard I gave up and assumed it was locked. I called the front desk and some people inside were pointing to me but none of the staff stepped away to help. It wasn't until an older women came to the door and failed to open it that the staff came to our aid. \n\nI didn't let this ageist action ruin my day and it didn't! The spa is about letting go so that was my first \"practice\" of the day ;)\n\nGreat therapeutic staff:\n\nI had a massage in the morning and a body scrub/hair treatment in the afternoon. \n\nThe massage therapist was so attentive and I could tell he was paying attention to the stresses in my body. I'd HIGHLY recommend having your massage in the outdoor tent. (His name was Leonard or Laurent; his handwriting was messy)\n\nThe esthetician was also very attentive and personable. (Her name was Jennifer)\n\n*I will triple check their names but I'd recommend them to friends and family*\n\nCalm general vibes:\n\nIt was not crowed on the Sunday that I went. There were two cold and two hot baths. There was a large eucalyptus steam room and two traditional saunas. There was lots of outdoor seating and one indoor reclining chair room.  \n\nOverall/General Comments:\n\nI'd recommend it and go again. It's a lovely spot by the water, surrounded by trees and not far from downtown. I hope to check out the other Strøm locations in the future! \n\nI've been Scandinave Spa and Bota Bota in the old port but they were smaller than this Strøm location. \n\nThey weren't so strict about the quiet rule so it's a place where you could chat quietly with a friend but not be too annoyed with people talking all of the time.", "date": "2018-10-15 22:16:27"}
{"review_id": "2zA80Zrbt-z8-ox7AemG9Q", "user_id": "WXlxViTwXHPBvhioljN9PQ", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 3.0, "useful": 2, "funny": 0, "cool": 1, "text": "We chose the Strom Spa for a nice end to a busy girls' shopping day!  Unfortunately, we arrived a bit later than expected due to the fact that exit to Ile des Soeurs was closed and we had to turn around on the bridge which was extremely busy at that time. \n\nWe arrived about an hour before the 10pm closing time.  We wanted to take advantage of the after 6pm price of $29 as advertised on their website but was told that the prices had just gone up to $34 that week.  Disappointing.  I thought they should have still honoured the $29 price.  Flip flops and bath robes ($10) are available for rental but we brought our own flip flops.  Lockers with a key and 2 towels are provided at no extra cost.  Bring your own bottle water but there is a small dispenser near the change rooms with cucumber and mint infused water.\n\nWe enjoyed the hot tubs and the refreshing cold pools.  Sauna and steam rooms were also nice.  We had to skip the resting areas as we were pressed for time but they looked very relaxing as well.\n\nLoved the modern decor of the spa.  Definitely a nice getaway for couples as well. \n\nDon't expect to be able to talk too loudly with your companions as you wil be shooshed by staff who are trying to maintain the quiet and serene enviroment.\n\nWished we would have had more time to enjoy the spa so would love to come back again in the future.  Drove around a few of the neighbourhoods in the Ile du Soeurs area to gawk at the mansions on our way home.", "date": "2011-05-24 16:24:31"}
{"review_id": "iuy4-XnfeMjAVmeZJsPRvQ", "user_id": "qKpkRCPk4ycbllTfFcRbNw", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "Spa nordique avec grand aire exterieur joliment aménagé. Grandes piscines chaudes et le staff est courtois.\n\nTres beau pour les soirées plein lune.", "date": "2016-02-23 14:36:30"}
{"review_id": "O8eg8Kw8NTp0ZXmvtqi1LQ", "user_id": "V6yxlGOfbFt-XYQxxRLd0g", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Another spa day with friends for my birthday this year. We chose Strom after showing at another one and not knowing it was going to be closed. But I had heard great things about it so why not. \n\nWe tried it on a Tuesday night, so not the most busy time for spas. Yet, it was kind of busy. Very nice modern spa, clean and nice staff. You can whisper with your friends, and they have more than just one hot tub and all that jazz. \n\nOnly thing is we arrived late at night, it was our first time and no one showed us the premises. So we had t try to figure it out and the place, though lit, was quite dark.\n\nOverall, I would still suggest it to friends and would be curious to go see it in daytime and discover its surrounding.\n\n---", "date": "2011-12-21 17:16:48"}
{"review_id": "z3oOR7_gFrDzcUvIJg5nfw", "user_id": "3vGiPNH4yCAj88-kfdvbjw", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 4.0, "useful": 5, "funny": 0, "cool": 3, "text": "Having been planning our wedding for a few months now, it's not surprising that we've been really tense recently...So, I figured that a gift of the well-known Strom spa day would be the ideal way to spend our Sunday. I have to say, that I was concerned about the outdoor thermal pools due to the freezing weather we've been having, but man was I pleasantly mistaken!\n\nUpon arriving, we were warmly greeted and given instructions on where to change, where to go for our massages, and how to use the thermal bath experience. \n\nMy first impression of the facility was that it was very well maintained, super clean, and quite modern (which I'm a huge fan of). The women's change room was superb. I had read several reviews complaining about how small it was, but this couldn't be further from the truth! The rooms are perfectly sized for the facility, and even though it was busy when we were there, the change room was not packed in the least. Again, mirroring the rest of the facility, it was clean, modern, and quite new in appearance. I appreciated the great smelling shampoo/conditioner/body wash, and all the little extras (hair dryer, etc) available. I just wish that there was a swimsuit spinner thing, and a place to leave the towels in the change room instead of having to drag everything back up to the reception.\n\nUpon entering the massage waiting room, we were greeted by our two masseuses, a little dryly. It was nothing close to the regular warm welcome one would expect at a spa, and was quite robotic. So, that got us off to a weird start. Fiance even said that he felt a little off.. (actually, words were \"Now I'm scared\" haha). I wish they were a bit friendlier to set a good atmosphere up for us. Nonetheless, the massages were quite good and relaxing, and the cup of hot tisane at the end was a nice treat. \n\nBy the time we were done, it had started raining, but that didn't stop us from jumping into the 38 degree bath which was phenomenal in the open air. After about 15 minutes, we took a quick (and I mean super quick) dip in the 5 degree pool as is recommended. We then went into one of the dry saunas for a bit, and went to grad lunch at the bistro. The spinach dip with veggies was yummy, and fiance's cubano sandwich and salad were great. We repeated the thermal cycle once more, and then sat underneath some great heaters in our fluffy robes and vegged out. \n\nNeedless to say, it was a great experience, and we were very very very reluctant to leave and face life again.\n\nOnly reason for the 4 stars is the way we were spoken to by our massage therapists. If only they were friendly and capable of smiling, this review would have gotten 5 stars!\n\nWe will definitely return though! Try it out - I don't think you'll be disappointed!", "date": "2012-12-03 01:34:25"}
{"review_id": "OmPyP-OsgsjVzu0zHapcug", "user_id": "1Bljt-GngRP4XxkQFLnHHQ", "business_id": "WUiijvxhIfOs7_4yrG8j8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Strøm is a very nice spa and the fact that it is located 10 minutes from downtown Montreal is awesome. The Montreal area offers some great urban and countryside spas, but in Strøm you get the best of both worlds. The convenience of an urban location in a mostly countryside setting. When you are sitting in Strøm's hot tubs you would never imagine that you are minutes from downtown. The spa is located on a small lake with a wooded park separating you from the nearest residential area. You can see a couple of condo towers off in the distance, but you otherwise have no feeling of being in the city. It s a really nice and relaxing setting. \n\nAs for the spa facilities, Strøm offers you everything that you would expect: two hot tubs, two cold tubs, steam room, dry saunas, various relaxation areas and massage and other services. \n\nWe recently purchased a 6 month evening membership, which are available at very reasonable prices, and have been enjoying quick trips to the spa ever since.", "date": "2015-11-16 23:45:36"}
