{"review_id": "NJU3tREoFLpRy6Wst9Lf3Q", "user_id": "kR8PxLu2xEyq4PPPoKJ-Mg", "business_id": "UIRSlulsMvfZpULunCEggw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Fantastic view of the city. I went right after a storm rolled through, which made the colors of everything just pop. Definitely a place you need to visit, I think I prefer this view over the Mt Washington view.", "date": "2014-06-12 12:09:43"}
{"review_id": "5to4VeLS01wXdbMu5nSBNA", "user_id": "UsmTxWbobLsI6WR1Db0W7A", "business_id": "UIRSlulsMvfZpULunCEggw", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "More of a Golden Triangle \"view\", you see how and where the three rivers come come together. Good view for the 496 fireworks displays that happen during the summer.", "date": "2011-03-26 04:49:59"}
{"review_id": "nEeQyUjJHbO7pOFjNTXP_w", "user_id": "3KkT6SmPFLGvBS1pnDBr8g", "business_id": "UIRSlulsMvfZpULunCEggw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I learned about this place from DH while we started dating.   He had dared to show me something beautiful about Pittsburgh that I had never seen before on our second date.  I didn't think it was possible since he wasn't a Pittsburgh native.  Apparently most Pittsburgh natives don't know about this place - how sad!  I was blow away by the view.  In my opinion it's much better than Mount Washington, and it's now a place we regularly take our guests to see.", "date": "2012-03-27 18:06:17"}
{"review_id": "9V0mI3yHnRE69YckEUaEmw", "user_id": "91koVXu54Y6tIiZKKxVmrw", "business_id": "UIRSlulsMvfZpULunCEggw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "The best and most underrated scenic view of the City of Pittsburgh!  Can be hard to find for an outsider but once you are here you will be happy that you made the trip.", "date": "2015-08-29 02:47:45"}
{"review_id": "S31xX7cm18zSee_tHK5NVg", "user_id": "ee9X7FcJvSJ2e770gOwWnA", "business_id": "UIRSlulsMvfZpULunCEggw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Outstanding view of my beloved hometown. Every time I visit someone tells me that they've lived in Pittsburgh all their lives and never made the trip. Definitely worth the time and effort to visit and make sure somebody brings a camera. You won't be disappointed, I've taken some great pics in bad weather.", "date": "2017-11-28 17:20:30"}
{"review_id": "6crEPtOSpIRqkzFMZ90MLA", "user_id": "rCWrxuRC8_pfagpchtHp6A", "business_id": "UIRSlulsMvfZpULunCEggw", "stars": 5.0, "useful": 6, "funny": 1, "cool": 1, "text": "I think you actually get a better view of the city here than you do in Mount Washington. Plus, it's not as crowded and noisy on a warm summer night. It's also a beautiful, clean park with walkways and seats and was recently renovated.", "date": "2009-07-24 04:10:05"}
