{"review_id": "I_adivVIfyA5uX70Dhzc8w", "user_id": "pEzb9RfmnD2zn5wUPpdmzg", "business_id": "mPuJAD2dEw3Wax-JlUnEBw", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "Honnetement : un sushi shop c'est un sushi shop. A celui sur l'ile des soeurs j'ai toujours eu des produits frais et prepares pour moi. Comme a tous les autres, ils offrent le comptoir pour emporter.  Ils ont aussi cette petite section ou ils vendent des produits pour preparer les sushis chez soi. \n\nMais la 4e etoile revient a la terrasse exterieure qui m'a permis de diner dehors et de profiter du beau temps avec mon amoureux. \n\nNe vous deplacez pas pour y aller,  mais si vous vous y trouvez et cherchez un lunch rapide vous serez servis :)", "date": "2012-05-31 13:51:58"}
{"review_id": "JQUHHCBzHp0dWgQXAXmTXQ", "user_id": "aqoYGjKuTM0rHv5IMSbqPQ", "business_id": "mPuJAD2dEw3Wax-JlUnEBw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Came here for the first time while visiting Montréal. Stopped by to get a quick bite to hold us over until dinner. The staff was friendly and the burrito was made in less than 5 minutes. It was delicious, fresh and rolled well. Definitely recommend trying this place out. Could use some music in the place though. Kinda quiet in there.", "date": "2017-10-02 21:55:16"}
{"review_id": "wPKFoajYHM73UUDl3VkLKw", "user_id": "CtBx4yk_QM8ClITgw94TPQ", "business_id": "mPuJAD2dEw3Wax-JlUnEBw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Half decent sushi but even when they're not busy, the service is ridiculously slow. If you call ahead and they say 30 minutes, expect to wait an additional 30 minutes. Very frustrating.", "date": "2018-07-20 21:45:52"}
{"review_id": "I1IsGBkcFjY81e4Jzf0J9w", "user_id": "U1vl4SQzO3wTAWlYVnSjnw", "business_id": "mPuJAD2dEw3Wax-JlUnEBw", "stars": 3.0, "useful": 4, "funny": 1, "cool": 2, "text": "A bit pricey but they have a large selection. The shop is always clean but that could be because no one is ever inside. The staff kinda ignored me while preparing my to go order, he was training a new employee. The sushi was good. The rice was a bit stiff but I was expecting that.", "date": "2016-04-28 19:47:29"}
{"review_id": "3VoNdT21fHrCRizj6HejPw", "user_id": "Zoec9wehLFa8CV1JnCCVug", "business_id": "mPuJAD2dEw3Wax-JlUnEBw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "This store of Sushi Shop maintains the standard for fresh fish and has always all the ingredients for the relatively big menu. It is a good option if you want to pick quick sushi lunch or dinner. The place itself is neat, but not very inviting to stay and have the meal there. Most of the time the restaurant will have ready combos to pick or you can order  from the menu if enough time, it takes 20 minutes to prepare. The second option is better if you want to remove the mayo from the rolls, the personnel will accommodate similar request. Not a fan of the miso soup, also the rice is sometimes drier then it should be for sushi.", "date": "2014-01-14 12:40:48"}
