{"review_id": "R_6fkDvUc12xgYBgv5h5fw", "user_id": "UHLAn6VTZYmEdzfHiiLumQ", "business_id": "Xi94a3ODU40lSQPd54Dh8w", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Go here, get yourself a 4/4 with spicy nuggets and check the bag because sometimes they forget stuff. Overall my experience here has not been bad.", "date": "2018-06-10 17:01:28"}
{"review_id": "cdkitk4skevvyyvvuFs7Xg", "user_id": "QV0fUbMOzKRNaSZaljYdsw", "business_id": "Xi94a3ODU40lSQPd54Dh8w", "stars": 2.0, "useful": 2, "funny": 0, "cool": 0, "text": "This store was recently remodeled and transformed into an asthetically pleasing enviroment...HOWEVER; same careless rude staff that can't get their orders correct. The money spent in the remodel should have went into hiring competent staff.", "date": "2012-07-30 01:04:29"}
{"review_id": "4YuiklzFtKGEA2KKmSOwEg", "user_id": "v3okI_OJI1G3TAKBMlP54A", "business_id": "Xi94a3ODU40lSQPd54Dh8w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Dropping by to even the score and do it some justice, as the miracle of the availability heuristic really brings the average rating down. Have you ever heard the old saying \"You get what you pay for\"? You're probably spending about $3-5 at Wendy's, so excuse the staff for not serving it to you on a golden platter.\n\n If you want real quality food and staff that are actually happy with their pay to serve you and do it excellently, I suggest you go to a formal restaurant. Does that cost too much for you? Then keep blowing your money on sub-standard food, then continue doing what you're doing, but please, don't rant and rave at the staff because your cheeseburger was cold after you decided to open it thirty minutes later at home. You can get any order fixed by being kind and level-headed than you could by acting like a spoiled brat. A little kindness goes a long way.\n\nDISCLAIMER: Not all customers are this way, just a steady, vocal minority.\n\nSource: Used to work there, some people are venomous.", "date": "2014-10-09 18:56:12"}
