{"review_id": "uV9295aMp9M7XFbMovX3ZQ", "user_id": "qCBtl-VTEuGjP3B0XKrYcg", "business_id": "tJRDll5yqpZwehenzE2cSg", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "We stayed here on a stopover on the way to Montreal and we're glad we did. The owners, Rick and Lorraine are not only wonderful hosts, they're great chefs too. The New Zealand lamb evening meal was top-notch, and the fresh homemade croissants (which you _can_ have made into french toast) were a treat. The room was spotless, the bed comfortable (though queen-size in the room we had) and the ambience of the place, well, we could just imagine the scene in the early 1800s around the stone fireplace. A warm and inviting place to stay in the area, just off highway 2 but with no traffic noise whatsoever. Highly recommended!", "date": "2014-07-08 00:21:31"}
{"review_id": "eagZe7no7Sh0UadwaIIq_A", "user_id": "zcTZk7OG8ovAmh_fenH21g", "business_id": "tJRDll5yqpZwehenzE2cSg", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Unbelievable cute nicest owners ever. I got in late and Loraine made sure she kept the door unlocked for me. Since it was so late she made me a sandwich and a local beer.\n\nThe owners prepared fresh blueberry crepes the following morning with fresh OJ and scrambled eggs with cheese.\n\nIf you find yourself in the area, stay here. \n\nIt is less expensive than the chain hotels and whatnot, and the quality and the service is significantly superior.", "date": "2012-07-26 17:12:04"}
{"review_id": "h3VNr3tDJdzl7UFetMyIvg", "user_id": "woHLnTlu_0JyqzgoMStoUw", "business_id": "tJRDll5yqpZwehenzE2cSg", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "This place is just adorable. The owner is very warm and welcoming. Very cozy inside. Full bar. I got the rib eye steak. Expertly cooked and paired well with potatoes and broccoli. Just a nice meal overall. I had the peanut butter pie for dessert.", "date": "2014-08-10 01:43:38"}
{"review_id": "2KkZ-xAFNHGNEZiDUEb3dQ", "user_id": "KDCx3HtEbx_ReHHsmlWYDw", "business_id": "tJRDll5yqpZwehenzE2cSg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We always enjoy a meal at Randsim Bay.\n\nTonight surf and turf with wonderful scallops.\n\nSmall tasty and just plain good", "date": "2017-07-15 00:34:04"}
{"review_id": "pO6C-0Ka4xV6kNKMmJaqog", "user_id": "tMFSVOtYfzt159iCP-kE4Q", "business_id": "tJRDll5yqpZwehenzE2cSg", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "This place was superior, pricy but superior. We pulled into town around 815pm, all of the places to eat had closed down. We spoke to the person at the hotel where we were going to stay and they recommended we call over to Lorraine. They stayed open just for us.  The food was delicious!  \n\nI got the scallop special with beets and there jasmine portobello vidalia rice.  It was excellent. $36\n\nThe other half got the half rack of lamb and potatoes.  He was very pleased.\n\nMy uncle got the ribeye with a horseradish sauce and potatoes, he said it was amazing.\n\nWe all got drinks. The margaritas were phenomenal, strong and just right mixture.  The other half got Malbec wine and was pleased, $8/glass.\n\nWe got the creme brûlée that was amazing.  My uncle got the strawberry rhubarb pie which he said was awesome.   Desserts were only $3.50 each.\n\nWe would definitely recommend this place for food.  My uncle said it was one of the best meals he ever had.\n\nThe small wait staff is personable, helpful, and very kind.  The atmosphere is cozy and could easily be adapted for a romantic setting.  Music is a mix.\n\nWe cannot wait to go back. Lorraine was the hostess and Lisa was or server.", "date": "2016-07-09 16:09:08"}
