{"review_id": "tZGnFQQcxQDNKL-m9zSvVA", "user_id": "klj4q4_8qyG1sTyPefurXw", "business_id": "_WbkQha0xqf2DnYumHAaqg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Did a great job taking down a massive Linden on our place on Isle La Motte!  It was a busy season, but they kept us up to date on when they were turning up and did an amazing job of getting it down and cleaning up afterwards.\n\nI'll definitely use them again!", "date": "2016-09-07 12:25:47"}
{"review_id": "q2A3mb7T5MisYHXwSfa1dQ", "user_id": "Bic_gIQ6F0vJdD7LGtnYvA", "business_id": "_WbkQha0xqf2DnYumHAaqg", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Poor business practices. These people decided not to show up. No phone call, nothing. Not dependable at all. Horrible experience! Don't get!", "date": "2016-09-08 13:36:10"}
{"review_id": "0Zvzq9hnpWlJAqaGdweMPg", "user_id": "WFSW_tX9xODo9W_rAnk9Fw", "business_id": "_WbkQha0xqf2DnYumHAaqg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Island Tree Service is as good as it gets! A small business with around 3-4 employees, They were able to come to my house, give me a quote, return within 3 days to do the job and uncut the prices of all the other tree services available!\n\nI had about a 60-ish foot weeping willow tree right next to my house, other well known tree services in the area took 4 days or more to call me back with a quote in the $1500.00 - $1800.00 range!\n\nWhen I called Island Tree Service, the owner answered right away, made an appointment to come give me an estimate within 24 hours and scheduled the removal for the tree within 72 hours! I was prepared for the worst when it came to the price, however Island Tree Service's price was only $1200.00! Truly the best price around!\n\nWithout using a crane they were able to limb this tree, have it all fall straight down without damaging my deck which was within 5 feet of the tree!\n\nAfter the tree was down, the clean up was awesome, they separated and stacked some limb wood for me as I like to have back yard campfires, and loaded their truck up with the rest and hauled it away! They even carved my family's last name into the stump with the chainsaw!\n\nI highly recommend everyone to call Island Tree Service before paying any other local/well known tree service", "date": "2014-09-09 03:13:37"}
